Documents/CRM_ЗаписьНаВыдачу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>CRM_ЗаписьНаВыдачу</Name>
			<BasedOn>
				<xr:Item>Document.CRM_КоммерческоеПредложение</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Renault_АвтомобилиКВыдаче</xr:Item>
				<xr:Item>InformationRegister.CRM_АвтомобилиВыданные</xr:Item>
				<xr:Item>InformationRegister.CRM_ЗаписиНаВыдачу</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_СтатусыДокументаЗаписьНаВыдачу</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IDK</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>17</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продолжительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗонаВыдачи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ЗоныВыдачиАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаАвтомобили</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорНаПродажуАвтомобиля</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_Договор</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СогласиеНаОбработкуПерсональныхДанных</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.DMS_СогласиеНаОбработкуПерсональныхДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>АвтомобилиДляВыдачи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Автомобиль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>VIN</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выбран</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/CRM_ЗаписьНаВыдачу/Ext/ManagerModule.bsl
Функция ПолучитьДанныеПечати(знач МассивДокументов, знач МассивИменМакетов) Экспорт
	
	ДанныеПоВсемОбъектам = Новый Соответствие;
	
	Для Каждого ОбъектСсылка Из МассивДокументов Цикл
		ДанныеОбъектаПоМакетам = Новый Соответствие;
		Для Каждого ИмяМакета Из МассивИменМакетов Цикл
			ДанныеОбъектаПоМакетам.Вставить(ИмяМакета, ПолучитьДанныеОбъекта(ОбъектСсылка, ИмяМакета));
		КонецЦикла;
		ДанныеПоВсемОбъектам.Вставить(ОбъектСсылка, ДанныеОбъектаПоМакетам);
	КонецЦикла;
	
	ОписаниеОбластей = Новый Соответствие;
	ОписаниеОбластей.Вставить(ИмяМакета, ПолучитьОписаниеОбластейМакетаОфисногоДокумента());
	ДвоичныеДанныеМакетов = Новый Соответствие;
	ТипыМакетов = Новый Соответствие;
	
	Для Каждого ИмяМакета Из МассивИменМакетов Цикл
		Если ИмяМакета = "ПФ_DOC_Выдача" Тогда
			ДвоичныеДанныеМакетов.Вставить(ИмяМакета, Renault_УправлениеПечатью.ПолучитьМакет("Документ.CRM_ЗаписьНаВыдачу.ПФ_DOC_Выдача"));
			ТипыМакетов.Вставить(ИмяМакета, "DOC");
		ИначеЕсли ИмяМакета = "ПФ_MXL_СертификатКонтроля" Тогда
			ДвоичныеДанныеМакетов.Вставить(ИмяМакета, Renault_УправлениеПечатью.ПолучитьМакет("Документ.CRM_ЗаписьНаВыдачу.ПФ_MXL_СертификатКонтроля"));
			ТипыМакетов.Вставить(ИмяМакета, "MXL");
		КонецЕсли;
	КонецЦикла;
	
	Возврат Новый Структура("Данные, Макеты",
							ДанныеПоВсемОбъектам,
							Новый Структура("ОписаниеОбластей, ТипыМакетов, ДвоичныеДанныеМакетов",
											ОписаниеОбластей,
											ТипыМакетов,
											ДвоичныеДанныеМакетов));
	
КонецФункции

Функция ПолучитьДанныеОбъекта(СсылкаНаОбъект, ИмяМакета)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	*
	               |ИЗ
	               |	Документ.CRM_ЗаписьНаВыдачу КАК CRM_ЗаписьНаВыдачу
	               |ГДЕ
	               |	CRM_ЗаписьНаВыдачу.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
	Выборка = Запрос.Выполнить().Выбрать();
		
	Если Выборка.Следующий() Тогда		
		
		ДанныеОбъекта = Новый Структура;
		
		ДанныеОбъекта.Вставить("Ссылка", Выборка.Ссылка);
		ДанныеОбъекта.Вставить("Дата", Формат(Выборка.Дата, "ДФ='дд ММММ гггг'"));		
		
		ВыборкаАвтомобилиДляВыдачи = Выборка.АвтомобилиДляВыдачи.Выбрать();
		
		Если ВыборкаАвтомобилиДляВыдачи.Следующий() Тогда
			ДанныеОбъекта.Вставить("Автомобиль", ВыборкаАвтомобилиДляВыдачи.Автомобиль);
			ДанныеОбъекта.Вставить("VIN", ВыборкаАвтомобилиДляВыдачи.VIN);
		КонецЕсли;
		
		//Клиент
		
		ДанныеОбъекта.Вставить("Клиент", Выборка.Клиент);
		Возврат ДанныеОбъекта;
		
	Иначе
		Возврат Неопределено;		
	КонецЕсли;
		
КонецФункции

Функция ПолучитьОписаниеОбластейМакетаОфисногоДокумента()
	
	ОписаниеОбластей = Новый Структура;
	
	Renault_УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "Заголовок", "Общая");
	
	Возврат ОписаниеОбластей;
	
КонецФункции

Функция ПолучитьЗаписьНаВыдачуПоРЛиДоговору (VIN = Неопределено, ДоговорНаПродажуАвтомобиля = Неопределено) Экспорт
	Если  VIN = Неопределено или ДоговорНаПродажуАвтомобиля = Неопределено  Тогда
		Возврат(Неопределено);
	КонецЕсли;
	 	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	CRM_ЗаписьНаВыдачу.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.CRM_ЗаписьНаВыдачу КАК CRM_ЗаписьНаВыдачу
		|ГДЕ
		|	CRM_ЗаписьНаВыдачу.VIN = &VIN
		|	И CRM_ЗаписьНаВыдачу.ДоговорНаПродажуАвтомобиля = &ДоговорНаПродажуАвтомобиля";
	
	Запрос.УстановитьПараметр("VIN", VIN);
	Запрос.УстановитьПараметр("ДоговорНаПродажуАвтомобиля", ДоговорНаПродажуАвтомобиля);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
	 Возврат(Неопределено);
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецФУнкции
